# vstSetEventInfo

## Description
Sets the VS Tool Event Return Value

```pascal
PROCEDURE vstSetEventInfo(
				inAction   : LONGINT;
				inMessage1 : LONGINT;
				inMessage1 : LONGINT;
				unused     : INTEGER);
```

```python

def vs.vstSetEventInfo(inAction, inMessage1, inMessage1, unused):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inAction|LONGINT||
|inMessage1|LONGINT||
|inMessage1|LONGINT||
|unused|INTEGER||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events